#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.cdn.aws_s3_bucket.origin,
  on .terraform/modules/cdn/main.tf line 259, in resource "aws_s3_bucket" "origin":
 259:   acl           = "private"

Use the aws_s3_bucket_acl resource instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_acm_certificate.this: Reading...
module.cdn.data.aws_region.current[0]: Reading...
module.cdn.module.logs.data.aws_caller_identity.current: Reading...
module.cdn.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.this: Reading...
module.cdn.module.logs.data.aws_partition.current: Reading...
module.cdn.data.aws_partition.current[0]: Reading...
data.aws_s3_bucket.this: Reading...
module.cdn.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.cdn.module.logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.cdn.module.logs.data.aws_caller_identity.current: Read complete after 0s [id=072105303426]
data.aws_s3_bucket.this: Read complete after 0s [id=kq4afy.xyz]
module.cdn.data.aws_s3_bucket.origin[0]: Reading...
module.cdn.data.aws_s3_bucket.origin[0]: Read complete after 0s [id=kq4afy.xyz]
data.aws_acm_certificate.this: Read complete after 1s [id=arn:aws:acm:us-east-1:072105303426:certificate/b89f103c-57a2-4aa5-bd9c-bfed2eb09df0]
data.aws_route53_zone.this: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.cdn.data.aws_iam_policy_document.s3_ssl_only[0]: Reading...
module.cdn.module.dns.data.aws_route53_zone.default[0]: Reading...
module.cdn.data.aws_iam_policy_document.s3_ssl_only[0]: Read complete after 0s [id=2782688795]
module.cdn.module.dns.data.aws_route53_zone.default[0]: Read complete after 0s [id=Z048504419NDW43VP1NZI]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cdn.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cdn.data.aws_iam_policy_document.s3_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_origin" {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::kq4afy.xyz/*",
            ]
          + sid       = "S3GetObjectForCloudFront"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::kq4afy.xyz",
            ]
          + sid       = "S3ListBucketForCloudFront"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cdn.aws_cloudfront_distribution.default[0] will be created
  + resource "aws_cloudfront_distribution" "default" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Managed by Terraform"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 60
          + max_ttl                = 31536000
          + min_ttl                = 0
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "kq4afy.xyz.s3.amazonaws.com"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.cdn.aws_cloudfront_origin_access_identity.default[0] will be created
  + resource "aws_cloudfront_origin_access_identity" "default" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.cdn.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = "kq4afy.xyz"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cdn.module.dns.aws_route53_record.default["kq4afy.xyz"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kq4afy.xyz"
      + type            = "A"
      + zone_id         = "Z048504419NDW43VP1NZI"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cdn.module.dns.aws_route53_record.ipv6["kq4afy.xyz"] will be created
  + resource "aws_route53_record" "ipv6" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kq4afy.xyz"
      + type            = "AAAA"
      + zone_id         = "Z048504419NDW43VP1NZI"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cdn.module.logs.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)
    }

  # module.cdn.module.logs.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "ForceSSLOnlyAccess"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cdn.module.logs.aws_s3_bucket.default[0] will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes" = "logs"
          + "Name"       = "logs"
        }
      + tags_all                    = {
          + "Attributes" = "logs"
          + "Name"       = "logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 5
          + enabled                                = true
          + id                                     = "logs"

          + expiration {
              + days = 90
            }

          + noncurrent_version_expiration {
              + days = 90
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.cdn.module.logs.aws_s3_bucket_ownership_controls.default[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cdn.module.logs.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cdn.module.logs.aws_s3_bucket_public_access_block.default[0] will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cdn.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
  + resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
      + create_duration  = "30s"
      + destroy_duration = "30s"
      + id               = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.module.logs.aws_s3_bucket.default[0],
  on .terraform/modules/cdn.logs/main.tf line 1, in resource "aws_s3_bucket" "default":
   1: resource "aws_s3_bucket" "default" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jbouse, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*